code-review/NRB_3471_3546/База_Стало/DataProcessors/ОчисткаВспомогательныхРегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОчисткаВспомогательныхРегистров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоОбрабатываемыхЗаписейВТранзакцииSQL</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвояБДSQL</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВнешниеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОчистки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРегистра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагОчистки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОчистки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ЖурналРегистрацииВызовов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналРегистрацииВызовов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Comment>Длительность в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаВызова</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВызова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ТипыВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихИсточников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БазаДанныхSQL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Папка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаОбменаДанными</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/ChartsOfCharacteristicTypes/ВнешниеИсточники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ВнешниеИсточники</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.НастройкиОбменаДанными</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:StringQualifiers>
					<v8:Length>250</v8:Length>
				</v8:StringQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнегоИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихИсточников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ОчисткаВспомогательныхРегистров/Ext/ObjectModule.bsl
Перем Соединение, Команда, RecordSet, ТипыЗапросов;

// Заполняет настройки обработки по умолчанию.
//
Процедура ИнициализироватьНастройки() Экспорт
	
	ДанныеОчистки.Очистить();
	
	ДобавитьДанныеДляОчистки("ЗамерыВремени", "ДатаЗаписиНачалоЧаса", 30);
	ДобавитьДанныеДляОчистки("ЖурналВходящихСообщенийKafka", "ПериодСообщения", 90);
	ДобавитьДанныеДляОчистки("ЖурналИсходящихСообщенийKafka", "ПериодСообщения", 90);
	ДобавитьДанныеДляОчистки("ЖурналРегистрацииВызовов", "ДатаВызова", 180);

	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	СвояБДSQL = ПланыВидовХарактеристик.ВнешниеИсточники.СвояБДSQL;

	МенеджерПараметров = РегистрыСведений.ПараметрыГлобальные;
	КоличествоОбрабатываемыхЗаписейВТранзакцииSQL =
		МенеджерПараметров.ЗначениеПараметра("597.КоличествоОбрабатываемыхЗаписейВТранзакцииSQL", 500000);
	
КонецПроцедуры

Процедура ДобавитьДанныеДляОчистки(ИмяРегистра, ПолеОтбора, ОставитьДнейСДаннымиПоУмолчанию)
	
	МенеджерПараметров = РегистрыСведений.ПараметрыГлобальные;
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());

	НоваяСтрока = ДанныеОчистки.Добавить();
	НоваяСтрока.ИмяРегистра = ИмяРегистра;
	НоваяСтрока.ФлагОчистки = Истина;
	ОставитьДнейСДанными = Число(МенеджерПараметров.ЗначениеПараметра("9721.Очистка." + ИмяРегистра, 
	               ОставитьДнейСДаннымиПоУмолчанию));
	НоваяСтрока.ДатаОчистки = ТекущаяДата - ОбщегоНазначенияПовтИсп.СекундВСутках(ОставитьДнейСДанными);
	НоваяСтрока.ПолеОтбора = ПолеОтбора;
	
КонецПроцедуры

// Очищает регистры в соответствии с настройками обработки
//
Процедура Очистить() Экспорт
	Для Каждого Строка Из ДанныеОчистки Цикл
		Если Строка.ФлагОчистки Тогда
			КоличествоСтрок = 0;
			ОчиститьРегистр(Строка.ИмяРегистра, Строка.ДатаОчистки, Строка.ПолеОтбора, КоличествоСтрок);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Удаляет записи регистра сведений до указанной даты (не включая).
//
// Параметры:
//  ИмяРегистра	 - Строка - Имя очищаемого регистра сведений
//  ДатаОчистки	 - Дата - Дата, до которой (не включая) удаляются записи регистра сведений
//  ИмяПоляОтбора - Строка - Имя поля отбора записей регистра для удаления
//  КоличествоСтрок - Число - возвращает количество удаленных строк
//
Процедура ОчиститьРегистр(ИмяРегистра, ДатаОчистки, ИмяПоляОтбора, КоличествоСтрокКУдалению) Экспорт
	
	Попытка
		ПараметрыПодключения = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(СвояБДSQL);
		
		ВидДействия = СтрШаблон("Очистка объекта %1: сервер %2, база %3", 
			ИмяРегистра, ПараметрыПодключения.Сервер, ПараметрыПодключения.База);
		ОписаниеВызова = РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова(
			"ОчисткаВспомогательныхРегистров", ВидДействия);
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьНачало(ОписаниеВызова);
		
		ЕстьОшибкиПодключения = Ложь;
		Если Не ЗначениеЗаполнено(СвояБДSQL) Тогда
			ТекстОшибки = "Не указан внешний источник БД SQL";
			ЕстьОшибкиПодключения = Истина
		ИначеЕсли СвояБДSQL.ТипВнешнегоИсточника <> Перечисления.ТипыВнешнихИсточников.БазаДанныхSQL Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"Ожидается тип '%1' внешнего источника '%2'",
				Перечисления.ТипыВнешнихИсточников.БазаДанныхSQL, СвояБДSQL);
			ЕстьОшибкиПодключения = Истина;
		ИначеЕсли Не ЗначениеЗаполнено(ПараметрыПодключения.Сервер) Или Не ЗначениеЗаполнено(ПараметрыПодключения.База) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"У внешнего источника '%1' не указан SQL-сервер и/или база данных", СвояБДSQL);
			ЕстьОшибкиПодключения = Истина;
		КонецЕсли;
		Если ЕстьОшибкиПодключения Тогда
			СообщитьОбОшибке(ТекстОшибки, ОписаниеВызова);
			Возврат;
		КонецЕсли;
		
		// Подключитья (или переподключиться) к базе SQL в которой хранится данная информационная база;
		ВнешниеДанные.ПодключитьсяКБазеSQL(ПараметрыПодключения, Соединение, Команда, RecordSet, ТипыЗапросов);
		
		СмещениеДат = СмещениеДатSQL();
		
		СтруктураSQL = СтруктураХраненияБазыДанныхSQL(ИмяРегистра, ИмяПоляОтбора);
		ИмяТаблицыSQL 		= СтруктураSQL.ИмяТаблицыSQL;
		ИмяПоляОтбораSQL 	= СтруктураSQL.ИмяПоляОтбораSQL;
		ПредставлениеДатыОчисткиSQL	= ДатаSQL(ДатаОчистки, СмещениеДат);
		ПредставлениеПустойДатыSQL	= ДатаSQL('17530101', СмещениеДат);
		
		ШаблонЗапроса = "SELECT count(*) as count FROM [dbo].[%1] WHERE [%2] < '%3'";
		КоличествоСтрокКУдалению = КоличествоСтрокТаблицы(ШаблонЗапроса, ИмяТаблицыSQL, ИмяПоляОтбораSQL, ПредставлениеДатыОчисткиSQL);
		
		Если КоличествоСтрокКУдалению > 0 Тогда
			КоличествоПорций = Цел(КоличествоСтрокКУдалению / КоличествоОбрабатываемыхЗаписейВТранзакцииSQL);
			Если КоличествоСтрокКУдалению % КоличествоОбрабатываемыхЗаписейВТранзакцииSQL <> 0 Тогда
				КоличествоПорций = КоличествоПорций + 1;
			КонецЕсли;
			
			НомерПорции = 1;
			Пока Истина Цикл
				// select top 1 1 as count выполняется быстрее, чем select count(*), а здесь это критично по скорости
				ШаблонЗапроса = "SELECT TOP 1 1 as count FROM [dbo].[%1] WHERE [%2] < '%3'";
				ПустаяВыборка = (КоличествоСтрокТаблицы(ШаблонЗапроса, ИмяТаблицыSQL, ИмяПоляОтбораSQL, ПредставлениеДатыОчисткиSQL) = 0);
				Если ПустаяВыборка Тогда
					Прервать;
				КонецЕсли;
				
				ШаблонЗапроса = "DELETE TOP (%1) FROM [dbo].[%2] WHERE [%3] < '%4'";
				ТекстЗапросаУдаления = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗапроса,
					Формат(КоличествоОбрабатываемыхЗаписейВТранзакцииSQL, "ЧРГ=' '; ЧГ=0"), ИмяТаблицыSQL, ИмяПоляОтбораSQL, ПредставлениеДатыОчисткиSQL);
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"Начало выполнения SQL-запроса очистки регистра сведений %1. Имя таблицы SQL: %2. Порция %3 из %4",
					ИмяРегистра, ИмяТаблицыSQL, НомерПорции, КоличествоПорций);
				СообщитьПользователюОПрогрессе(ТекстСообщения);
				
				ВнешниеДанные.SQLЗапрос(Команда, RecordSet, ТекстЗапросаУдаления, ТипыЗапросов.ОператорSQL);
				НомерПорции = НомерПорции + 1;
			КонецЦикла;
		КонецЕсли;
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Окончание выполнения SQL-запроса очистки регистра сведений %1. Имя таблицы SQL: %2. Удалено строк: %3",
			ИмяРегистра, ИмяТаблицыSQL, КоличествоСтрокКУдалению);
		СообщитьОЗавершении(ТекстСообщения, ОписаниеВызова);
		
	Исключение
		ТекстОшибкиИмяРегистра = "В процессе очистки регистра """ + ИмяРегистра + """ произошла ошибка. ";
		ТекстОшибки = ТекстОшибкиИмяРегистра + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		СообщитьОбОшибке(ТекстОшибки, ОписаниеВызова);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура СообщитьОбОшибке(ТекстСообщения, ОписаниеВызова)
	
	СообщитьПользователюОПрогрессе(ТекстСообщения, СтатусСообщения.Внимание);
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОшибку(ОписаниеВызова, ТекстСообщения);
	
КонецПроцедуры

Процедура СообщитьОЗавершении(ТекстСообщения, ОписаниеВызова)
	
	СообщитьПользователюОПрогрессе(ТекстСообщения);
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОкончание(ОписаниеВызова, ТекстСообщения);
	
КонецПроцедуры

Процедура СообщитьПользователюОПрогрессе(ТекстСообщения, Статус = Неопределено)
	
	ТекущаяДата = Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
	Сообщить(ТекущаяДата + " " + ТекстСообщения, ?(ЗначениеЗаполнено(Статус), Статус, СтатусСообщения.Информация));
	
КонецПроцедуры

Функция СтруктураХраненияБазыДанныхSQL(ИмяРегистра, ИмяПоляОтбора)
	ИменаМетаданных = Новый Массив();
	ИменаМетаданных.Добавить("РегистрСведений." + ИмяРегистра);
	СтруктураХраненияДанных = ПолучитьСтруктуруХраненияБазыДанных(ИменаМетаданных, Истина);
	
	НайденнаяСтрока = СтруктураХраненияДанных[0].Поля.Найти(ИмяПоляОтбора, "ИмяПоля");
	Если НайденнаяСтрока = Неопределено Тогда
		ТекстОшибки = "У регистра сведений " + ИмяРегистра + " не найдено поле " + ИмяПоляОтбора;
		ВызватьИсключение ТекстОшибки;
	Конецесли;

	Возврат Новый Структура("ИмяТаблицыSQL, ИмяПоляОтбораSQL", СтруктураХраненияДанных[0].ИмяТаблицыХранения,
		НайденнаяСтрока.ИмяПоляХранения);
КонецФункции

// Возвращает представление даты с учетом смещения
//
// Параметры:
//  ДатаОчистки	 - Дата
// 
// Возвращаемое значение:
//  Строка - дата с учетом смещения в базе SQL
//	Пример: '4019-10-01 00:00:00' если дата смещения=2000
//
Функция ДатаSQL(Дата, СмещениеДат)
	КоличествоМесяцев = 12 * Число(СмещениеДат);
	ДатаСоСмещением = ДобавитьМесяц(Дата, КоличествоМесяцев);
	Возврат Формат(ДатаСоСмещением, "ДФ='yyyy-MM-dd HH:mm:ss'");
КонецФункции

Функция СмещениеДатSQL()
	ТекстЗапроса = "SELECT Offset FROM [dbo].[_YearOffset]";
	ВнешниеДанные.SQLЗапрос(Команда, RecordSet, ТекстЗапроса, ТипыЗапросов.ОператорSQL);
	RecordSet.MoveFirst();
	СмещениеДат = RecordSet.Fields.Item("Offset").Value;
	Возврат СмещениеДат;
КонецФункции

Функция КоличествоСтрокТаблицы(ШаблонЗапроса, ИмяТаблицыSQL, ИмяПоляОтбораSQL, ПредставлениеДатыОчисткиSQL)
	ТекстЗапросаКоличествоСтрок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонЗапроса, ИмяТаблицыSQL, ИмяПоляОтбораSQL, ПредставлениеДатыОчисткиSQL);
	
	КоличествоСтрок = 0;
	ВнешниеДанные.SQLЗапрос(Команда, RecordSet, ТекстЗапросаКоличествоСтрок, ТипыЗапросов.ОператорSQL);
	
	Пока RecordSet.EOF() = 0 Цикл
		КоличествоСтрок = Число(СтрЗаменить(RecordSet.Fields.Item("count").Value, Символы.НПП, ""));
		RecordSet.MoveNext();
	КонецЦикла;
	
	Возврат КоличествоСтрок;
КонецФункции
